#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
module.test.data.aws_availability_zones.default: Reading...
module.test.data.aws_iam_policy_document.ec2_bastion: Reading...
module.test.data.aws_iam_policy_document.ec2_bastion: Read complete after 0s [id=814054711]
module.test.aws_iam_policy.ec2_bastion: Refreshing state... [id=arn:aws:iam::949263681218:policy/prod-eks-test-Vyaguta-bastion-policy]
module.test.data.aws_availability_zones.default: Read complete after 0s [id=us-east-1]
module.test.aws_ecr_repository.repository: Refreshing state... [id=vyaguta/test]
module.test.module.eks_ng_private.aws_iam_role.default_node: Refreshing state... [id=prod-eks-test-prod-eks-test-ng-private-role]
module.test.module.dev_ec2.data.aws_ami.image: Reading...
module.test.module.eks_ng_public.aws_iam_role.default_node: Refreshing state... [id=prod-eks-test-prod-eks-test-ng-public-role]
module.test.module.dev_ec2.aws_iam_role.ec2: Refreshing state... [id=bibek_bastion_host]
module.test.module.eks_cluster_public.aws_iam_role.default: Refreshing state... [id=prod-eks-test-vyaguta-role]
module.test.module.vpc_demo.aws_vpc.vpc: Refreshing state... [id=vpc-0be35d3ec8cfe40c7]
module.test.module.dev_ec2.data.aws_ami.image: Read complete after 0s [id=ami-08fdec01f5df9998f]
module.test.module.eks_ng_public.aws_iam_role_policy_attachment.node-AmazonEKSWorkerNodePolicy: Refreshing state... [id=prod-eks-test-prod-eks-test-ng-public-role-20230105061535246600000001]
module.test.module.eks_ng_public.aws_iam_role_policy_attachment.node-AmazonEC2ContainerRegistryReadOnly: Refreshing state... [id=prod-eks-test-prod-eks-test-ng-public-role-20230105061535246700000002]
module.test.module.eks_ng_public.aws_iam_role_policy_attachment.node-AmazonEKS_CNI_Policy: Refreshing state... [id=prod-eks-test-prod-eks-test-ng-public-role-20230105061535253800000003]
module.test.module.eks_cluster_public.aws_iam_role_policy_attachment.AmazonEKSClusterPolicy: Refreshing state... [id=prod-eks-test-vyaguta-role-20230105061535260700000005]
module.test.module.eks_cluster_public.aws_iam_role_policy_attachment.AmazonEKSVPCResourceController: Refreshing state... [id=prod-eks-test-vyaguta-role-20230105061535279500000007]
module.test.module.eks_ng_private.aws_iam_role_policy_attachment.node-AmazonEC2ContainerRegistryReadOnly: Refreshing state... [id=prod-eks-test-prod-eks-test-ng-private-role-20230105061535292500000008]
module.test.module.eks_ng_private.aws_iam_role_policy_attachment.node-AmazonEKSWorkerNodePolicy: Refreshing state... [id=prod-eks-test-prod-eks-test-ng-private-role-20230105061535266800000006]
module.test.module.dev_ec2.aws_iam_instance_profile.ec2: Refreshing state... [id=bibek_bastion_host]
module.test.module.eks_ng_private.aws_iam_role_policy_attachment.node-AmazonEKS_CNI_Policy: Refreshing state... [id=prod-eks-test-prod-eks-test-ng-private-role-20230105061535259700000004]
module.test.aws_iam_role_policy_attachment.policy_attachment_1: Refreshing state... [id=bibek_bastion_host-20230105061535398700000001]
module.test.module.vpc_demo.aws_internet_gateway.ig: Refreshing state... [id=igw-0a71a5315b10d544d]
module.test.module.vpc_demo.aws_subnet.private_subnet[1]: Refreshing state... [id=subnet-0e2168619ec824b87]
module.test.module.vpc_demo.aws_route_table.private: Refreshing state... [id=rtb-0d426ae1dea6c72a1]
module.test.module.vpc_demo.aws_subnet.private_subnet[0]: Refreshing state... [id=subnet-0760955b775581f42]
module.test.module.dev_ec2.aws_security_group.ec2: Refreshing state... [id=sg-03905cc227bbe5e87]
module.test.module.vpc_demo.aws_route_table.public: Refreshing state... [id=rtb-089879fe1a67a1725]
module.test.module.vpc_demo.aws_subnet.public_subnet[0]: Refreshing state... [id=subnet-0b30d5f024578d980]
module.test.module.vpc_demo.aws_subnet.public_subnet[1]: Refreshing state... [id=subnet-06d0868b90467e973]
module.test.module.vpc_demo.aws_eip.nat_eip: Refreshing state... [id=eipalloc-0f8690cc26757bad5]
module.test.module.vpc_demo.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0ce13ca1317327560]
module.test.module.vpc_demo.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0adfcd2f59d9954c8]
module.test.module.eks_cluster_public.aws_eks_cluster.default: Refreshing state... [id=prod-eks-test-vyaguta]
module.test.module.dev_ec2.aws_instance.ec2: Refreshing state... [id=i-0e0dc5a08ff98586a]
module.test.module.vpc_demo.aws_nat_gateway.nat: Refreshing state... [id=nat-06f09bd10061ba08b]
module.test.module.vpc_demo.aws_route.public_internet_gateway: Refreshing state... [id=r-rtb-089879fe1a67a17251080289494]
module.test.module.vpc_demo.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-094accd9724b31aa3]
module.test.module.vpc_demo.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0307b91a0b2aaa0c2]
module.test.module.vpc_demo.aws_route.private_nat_gateway: Refreshing state... [id=r-rtb-0d426ae1dea6c72a11080289494]
module.test.module.eks_ng_private.aws_eks_node_group.default_node: Refreshing state... [id=prod-eks-test-vyaguta:prod-eks-test-prod-eks-test-ng-private]
module.test.module.eks_ng_public.aws_eks_node_group.default_node: Refreshing state... [id=prod-eks-test-vyaguta:prod-eks-test-prod-eks-test-ng-public]
module.test.module.dev_ec2.aws_eip.elastic_ip[0]: Refreshing state... [id=eipalloc-058fca8c816c4fc86]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.test.aws_ecr_repository.test2 will be created
  + resource "aws_ecr_repository" "test2" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "vyaguta/test2"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Creator"   = "Vyaguta"
          + "Deletable" = "false"
          + "Name"      = "Vyaguta-prod-eks-test"
          + "Project"   = "DocVocate"
        }
      + tags_all             = {
          + "Creator"   = "Vyaguta"
          + "Deletable" = "false"
          + "Name"      = "Vyaguta-prod-eks-test"
          + "Project"   = "DocVocate"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: 12.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "12.plan"

```
</details>
*Pushed by: @deesirouss, Action: `pull_request`*